perf-testing/2.x/oauth-2x.log
Route Benchmark Results - RHOAI 2.x with OAuth
Generated: Tue Nov 18 09:00:15 AM CST 2025
Configuration: 10000 requests, 50 concurrency, 5 iterations
Route URL: https://echo-server-2x-opendatahub.apps.rosa.f3d4c3l4i5u4x1v.fcu6.p3.openshiftapps.com

================================================================================

=== ITERATION 1 ===
Started: Tue Nov 18 09:00:17 AM CST 2025


Summary:
  Total:	9.5767 secs
  Slowest:	0.1655 secs
  Fastest:	0.0399 secs
  Average:	0.0471 secs
  Requests/sec:	1044.2032
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.040 [1]	|
  0.052 [9221]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.065 [679]	|■■■
  0.078 [49]	|
  0.090 [0]	|
  0.103 [0]	|
  0.115 [0]	|
  0.128 [0]	|
  0.140 [6]	|
  0.153 [13]	|
  0.166 [31]	|


Latency distribution:
  10% in 0.0431 secs
  25% in 0.0440 secs
  50% in 0.0455 secs
  75% in 0.0480 secs
  90% in 0.0512 secs
  95% in 0.0553 secs
  99% in 0.0644 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0399 secs, 0.1655 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0041 secs
  resp wait:	0.0465 secs, 0.0398 secs, 0.0744 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0028 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:00:29 AM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 2 ===
Started: Tue Nov 18 09:00:39 AM CST 2025


Summary:
  Total:	9.6045 secs
  Slowest:	0.1715 secs
  Fastest:	0.0403 secs
  Average:	0.0474 secs
  Requests/sec:	1041.1782
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.040 [1]	|
  0.053 [9294]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.067 [631]	|■■■
  0.080 [24]	|
  0.093 [0]	|
  0.106 [0]	|
  0.119 [0]	|
  0.132 [0]	|
  0.145 [6]	|
  0.158 [16]	|
  0.171 [28]	|


Latency distribution:
  10% in 0.0434 secs
  25% in 0.0442 secs
  50% in 0.0460 secs
  75% in 0.0482 secs
  90% in 0.0518 secs
  95% in 0.0550 secs
  99% in 0.0649 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0403 secs, 0.1715 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0046 secs
  resp wait:	0.0468 secs, 0.0403 secs, 0.0750 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0028 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:00:50 AM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 3 ===
Started: Tue Nov 18 09:01:00 AM CST 2025


Summary:
  Total:	9.6432 secs
  Slowest:	0.1696 secs
  Fastest:	0.0406 secs
  Average:	0.0475 secs
  Requests/sec:	1036.9974
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.041 [1]	|
  0.054 [9311]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.066 [568]	|■■
  0.079 [68]	|
  0.092 [2]	|
  0.105 [0]	|
  0.118 [0]	|
  0.131 [0]	|
  0.144 [1]	|
  0.157 [1]	|
  0.170 [48]	|


Latency distribution:
  10% in 0.0433 secs
  25% in 0.0442 secs
  50% in 0.0460 secs
  75% in 0.0482 secs
  90% in 0.0516 secs
  95% in 0.0554 secs
  99% in 0.0693 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0006 secs, 0.0406 secs, 0.1696 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0020 secs
  resp wait:	0.0468 secs, 0.0405 secs, 0.0825 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0032 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:01:12 AM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 4 ===
Started: Tue Nov 18 09:01:22 AM CST 2025


Summary:
  Total:	9.8230 secs
  Slowest:	0.2408 secs
  Fastest:	0.0397 secs
  Average:	0.0483 secs
  Requests/sec:	1018.0166
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.040 [1]	|
  0.060 [9716]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.080 [230]	|■
  0.100 [3]	|
  0.120 [0]	|
  0.140 [0]	|
  0.160 [0]	|
  0.180 [0]	|
  0.201 [4]	|
  0.221 [0]	|
  0.241 [46]	|


Latency distribution:
  10% in 0.0435 secs
  25% in 0.0444 secs
  50% in 0.0466 secs
  75% in 0.0488 secs
  90% in 0.0531 secs
  95% in 0.0559 secs
  99% in 0.0654 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0008 secs, 0.0397 secs, 0.2408 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0598 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.0473 secs, 0.0395 secs, 0.0848 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0031 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:01:34 AM CST 2025

--------------------------------------------------------------------------------

=== ITERATION 5 ===
Started: Tue Nov 18 09:01:44 AM CST 2025


Summary:
  Total:	9.8140 secs
  Slowest:	0.3026 secs
  Fastest:	0.0400 secs
  Average:	0.0475 secs
  Requests/sec:	1018.9576
  
  Total data:	140000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.040 [1]	|
  0.066 [9922]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.093 [26]	|
  0.119 [0]	|
  0.145 [9]	|
  0.171 [9]	|
  0.198 [32]	|
  0.224 [0]	|
  0.250 [0]	|
  0.276 [0]	|
  0.303 [1]	|


Latency distribution:
  10% in 0.0433 secs
  25% in 0.0442 secs
  50% in 0.0461 secs
  75% in 0.0483 secs
  90% in 0.0519 secs
  95% in 0.0553 secs
  99% in 0.0639 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0400 secs, 0.3026 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.0468 secs, 0.0399 secs, 0.3025 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0028 secs

Status code distribution:
  [200]	10000 responses



Completed: Tue Nov 18 09:01:56 AM CST 2025

--------------------------------------------------------------------------------