perf-testing/2.x/oauth-2x.log
Route Benchmark Results - RHOAI 2.x with OAuth
Generated: Thu Oct 23 07:26:08 AM CDT 2025
Configuration: 10000 requests, 50 concurrency, 5 iterations
Route URL: https://echo-server-opendatahub.apps.rosa.w7y7v5e1p9h9x1c.o65n.p3.openshiftapps.com

================================================================================

=== ITERATION 1 ===
Started: Thu Oct 23 07:26:11 AM CDT 2025


Summary:
  Total:	10.9324 secs
  Slowest:	0.3114 secs
  Fastest:	0.0411 secs
  Average:	0.0536 secs
  Requests/sec:	914.7110
  
  Total data:	6244813 bytes
  Size/request:	624 bytes

Response time histogram:
  0.041 [1]	|
  0.068 [9526]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.095 [413]	|■■
  0.122 [9]	|
  0.149 [0]	|
  0.176 [18]	|
  0.203 [32]	|
  0.230 [0]	|
  0.257 [0]	|
  0.284 [0]	|
  0.311 [1]	|


Latency distribution:
  10% in 0.0465 secs
  25% in 0.0481 secs
  50% in 0.0508 secs
  75% in 0.0559 secs
  90% in 0.0623 secs
  95% in 0.0678 secs
  99% in 0.0874 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0411 secs, 0.3114 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0023 secs
  resp wait:	0.0529 secs, 0.0410 secs, 0.3111 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0040 secs

Status code distribution:
  [200]	10000 responses



Completed: Thu Oct 23 07:26:24 AM CDT 2025

--------------------------------------------------------------------------------

=== ITERATION 2 ===
Started: Thu Oct 23 07:26:34 AM CDT 2025


Summary:
  Total:	10.5572 secs
  Slowest:	0.2244 secs
  Fastest:	0.0412 secs
  Average:	0.0520 secs
  Requests/sec:	947.2240
  
  Total data:	6245601 bytes
  Size/request:	624 bytes

Response time histogram:
  0.041 [1]	|
  0.059 [8960]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.078 [938]	|■■■■
  0.096 [44]	|
  0.114 [7]	|
  0.133 [0]	|
  0.151 [0]	|
  0.169 [0]	|
  0.188 [2]	|
  0.206 [19]	|
  0.224 [29]	|


Latency distribution:
  10% in 0.0460 secs
  25% in 0.0475 secs
  50% in 0.0494 secs
  75% in 0.0531 secs
  90% in 0.0599 secs
  95% in 0.0655 secs
  99% in 0.0780 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0007 secs, 0.0412 secs, 0.2244 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0496 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0018 secs
  resp wait:	0.0511 secs, 0.0411 secs, 0.1053 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0037 secs

Status code distribution:
  [200]	10000 responses



Completed: Thu Oct 23 07:26:47 AM CDT 2025

--------------------------------------------------------------------------------

=== ITERATION 3 ===
Started: Thu Oct 23 07:26:57 AM CDT 2025


Summary:
  Total:	10.5169 secs
  Slowest:	0.1825 secs
  Fastest:	0.0411 secs
  Average:	0.0519 secs
  Requests/sec:	950.8498
  
  Total data:	6245364 bytes
  Size/request:	624 bytes

Response time histogram:
  0.041 [1]	|
  0.055 [8195]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.069 [1568]	|■■■■■■■■
  0.084 [164]	|■
  0.098 [22]	|
  0.112 [0]	|
  0.126 [0]	|
  0.140 [0]	|
  0.154 [9]	|
  0.168 [15]	|
  0.183 [26]	|


Latency distribution:
  10% in 0.0461 secs
  25% in 0.0476 secs
  50% in 0.0495 secs
  75% in 0.0534 secs
  90% in 0.0591 secs
  95% in 0.0641 secs
  99% in 0.0798 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0411 secs, 0.1825 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0019 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0025 secs
  resp wait:	0.0512 secs, 0.0410 secs, 0.0915 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0034 secs

Status code distribution:
  [200]	10000 responses



Completed: Thu Oct 23 07:27:09 AM CDT 2025

--------------------------------------------------------------------------------

=== ITERATION 4 ===
Started: Thu Oct 23 07:27:19 AM CDT 2025


Summary:
  Total:	11.2123 secs
  Slowest:	0.1837 secs
  Fastest:	0.0412 secs
  Average:	0.0548 secs
  Requests/sec:	891.8761
  
  Total data:	6243645 bytes
  Size/request:	624 bytes

Response time histogram:
  0.041 [1]	|
  0.055 [6958]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.070 [2337]	|■■■■■■■■■■■■■
  0.084 [490]	|■■■
  0.098 [133]	|■
  0.112 [22]	|
  0.127 [9]	|
  0.141 [0]	|
  0.155 [7]	|
  0.169 [11]	|
  0.184 [32]	|


Latency distribution:
  10% in 0.0465 secs
  25% in 0.0484 secs
  50% in 0.0516 secs
  75% in 0.0570 secs
  90% in 0.0662 secs
  95% in 0.0735 secs
  99% in 0.0949 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0005 secs, 0.0412 secs, 0.1837 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0052 secs
  resp wait:	0.0541 secs, 0.0412 secs, 0.1172 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0023 secs

Status code distribution:
  [200]	10000 responses



Completed: Thu Oct 23 07:27:32 AM CDT 2025

--------------------------------------------------------------------------------

=== ITERATION 5 ===
Started: Thu Oct 23 07:27:42 AM CDT 2025


Summary:
  Total:	10.5183 secs
  Slowest:	0.2557 secs
  Fastest:	0.0419 secs
  Average:	0.0519 secs
  Requests/sec:	950.7229
  
  Total data:	6245402 bytes
  Size/request:	624 bytes

Response time histogram:
  0.042 [1]	|
  0.063 [9563]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.085 [375]	|■■
  0.106 [11]	|
  0.127 [0]	|
  0.149 [0]	|
  0.170 [0]	|
  0.192 [0]	|
  0.213 [3]	|
  0.234 [22]	|
  0.256 [25]	|


Latency distribution:
  10% in 0.0461 secs
  25% in 0.0476 secs
  50% in 0.0495 secs
  75% in 0.0529 secs
  90% in 0.0580 secs
  95% in 0.0623 secs
  99% in 0.0760 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0009 secs, 0.0419 secs, 0.2557 secs
  DNS-lookup:	0.0004 secs, 0.0000 secs, 0.0748 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0021 secs
  resp wait:	0.0509 secs, 0.0412 secs, 0.0968 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0032 secs

Status code distribution:
  [200]	10000 responses



Completed: Thu Oct 23 07:27:55 AM CDT 2025

--------------------------------------------------------------------------------